docs/posts/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-30 Fri 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog - Michael</title>
<meta name="author" content="Michael Wang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <div>Lighthouse - Michael</div>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/">Profile</a></li>
        <li><a href="/">About</a></li>
    </ul>
</nav>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org659696a">3rd post</a></li>
<li><a href="#org723cba1">test post</a></li>
<li><a href="#orgf7db6c9">new post</a></li>
</ul>
</div>
</div>
<div id="outline-container-org659696a" class="outline-2">
<h2 id="org659696a"><a href="posts/third-post.html">3rd post</a></h2>
<div class="outline-text-2" id="text-org659696a">
<p>
Published: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-12-30 Fri&gt;</span></span>
</p>

<p>
Morbi placerat ligula a elementum tincidunt. Maecenas non massa ut quam dignissim mattis. Etiam lacus tortor, tempor vitae rhoncus sit amet, suscipit et nisl. Duis non nibh hendrerit, ultrices metus id, porta neque.
</p>

<p>
<a href="third-post.html">Read More&#x2026;</a>
</p>
<hr />
</div>
</div>
<div id="outline-container-org723cba1" class="outline-2">
<h2 id="org723cba1"><a href="posts/test-post.html">test post</a></h2>
<div class="outline-text-2" id="text-org723cba1">
<p>
Published: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-12-30 Fri&gt;</span></span>
</p>

<p>
Nunc auctor commodo aliquam. Donec in laoreet mauris. Nam rhoncus pulvinar velit elementum condimentum. Donec convallis massa finibus odio consectetur dignissim. Donec ultricies nunc ultricies nunc vehicula, non pulvinar justo egestas. Mauris aliquet dapibus scelerisque. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi 
</p>

<p>
<a href="test-post.html">Read More&#x2026;</a>
</p>
<hr />
</div>
</div>
<div id="outline-container-orgf7db6c9" class="outline-2">
<h2 id="orgf7db6c9"><a href="posts/new-page.html">new post</a></h2>
<div class="outline-text-2" id="text-orgf7db6c9">
<p>
Published: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-12-30 Fri&gt;</span></span>
</p>

<p>
test preview contextLorem ipsum dolor sit amet, consectetur adipiscing elit. Donec eu est at mauris pulvinar tincidunt. Maecenas odio urna, auctor quis tellus non, viverra hendrerit mauris. Nulla posuere luctus interdum. Sed efficitur semper dolor quis aliquet. Nam ut posuere mauris. Fusce porttitor nibh id neque facilisis, nec porttitor turpis fermentum. Duis scelerisque, lectus a vulputate fringilla, risus urna dictum mauris, sed euismod lectus erat vel nisl. Duis nibh justo, tempor in rutrum ut, fermentum in metus.
</p>

<p>
<a href="new-page.html">Read More&#x2026;</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    footer area
</footer>
</div>
</body>
</html>
